Tekla.Structures.Dialog.dotdiaUnitTypes_e
Specifies the Tekla Structures unit types.

Tekla.Structures.Dialog.dotdiaUnitTypes_e.INPUT_BOOLEAN
The input boolean.

Tekla.Structures.Dialog.dotdiaUnitTypes_e.INPUT_INTEGER
The input integer.

Tekla.Structures.Dialog.dotdiaUnitTypes_e.INPUT_STRING
The input string.

Tekla.Structures.Dialog.dotdiaUnitTypes_e.INPUT_NONE
The input none.

Tekla.Structures.Dialog.dotdiaUnitTypes_e.INPUT_RATIO_UNIT
The input ratio unit.

Tekla.Structures.Dialog.dotdiaUnitTypes_e.INPUT_STRAIN_UNIT
The input strain unit.

Tekla.Structures.Dialog.dotdiaUnitTypes_e.INPUT_ANGLE_UNIT
The input angle unit.

Tekla.Structures.Dialog.dotdiaUnitTypes_e.OUTPUT_ANGLE_UNIT
The output angle unit.

Tekla.Structures.Dialog.dotdiaUnitTypes_e.INPUT_SECTION_ANGLE_UNIT
The input section angle unit.

Tekla.Structures.Dialog.dotdiaUnitTypes_e.INPUT_LENGTH_UNIT
The input length unit.

Tekla.Structures.Dialog.dotdiaUnitTypes_e.OUTPUT_LENGTH_UNIT
The output length unit.

Tekla.Structures.Dialog.dotdiaUnitTypes_e.INPUT_DEFORMATION_UNIT
The input deformation unit.

Tekla.Structures.Dialog.dotdiaUnitTypes_e.OUTPUT_DEFORMATION_UNIT
The output deformation unit.

Tekla.Structures.Dialog.dotdiaUnitTypes_e.INPUT_DIMENSION_UNIT
The input dimension unit.

Tekla.Structures.Dialog.dotdiaUnitTypes_e.INPUT_RADIUSOFINERTIA_UNIT
The input radius of inertia unit.

Tekla.Structures.Dialog.dotdiaUnitTypes_e.INPUT_AREA_UNIT
The input area unit.

Tekla.Structures.Dialog.dotdiaUnitTypes_e.OUTPUT_REINFAREA_UNIT
The output reinforced area unit.

Tekla.Structures.Dialog.dotdiaUnitTypes_e.OUTPUT_TRANSVREINF_UNIT
The output transverse reinforcement unit.

Tekla.Structures.Dialog.dotdiaUnitTypes_e.INPUT_AREAPERLENGTH_UNIT
The input area per length unit.

Tekla.Structures.Dialog.dotdiaUnitTypes_e.OUTPUT_VOLUME_UNIT
The output volume unit.

Tekla.Structures.Dialog.dotdiaUnitTypes_e.INPUT_SECTIONMODULUS_UNIT
The input section modulus unit.

Tekla.Structures.Dialog.dotdiaUnitTypes_e.INPUT_VOLUME_UNIT
The input volume unit.

Tekla.Structures.Dialog.dotdiaUnitTypes_e.INPUT_MOMENTOFINERTIA_UNIT
The input moment of inertia unit.

Tekla.Structures.Dialog.dotdiaUnitTypes_e.INPUT_TORSIONCONSTANT_UNIT
The input torsion constant unit.

Tekla.Structures.Dialog.dotdiaUnitTypes_e.INPUT_WARPINGCONSTANT_UNIT
The input warping constant unit.

Tekla.Structures.Dialog.dotdiaUnitTypes_e.INPUT_FORCE_UNIT
The input force unit.

Tekla.Structures.Dialog.dotdiaUnitTypes_e.OUTPUT_FORCE_UNIT
The output force unit.

Tekla.Structures.Dialog.dotdiaUnitTypes_e.INPUT_WEIGHT_UNIT
The input weight unit.

Tekla.Structures.Dialog.dotdiaUnitTypes_e.OUTPUT_WEIGHT_UNIT
The output weight unit.

Tekla.Structures.Dialog.dotdiaUnitTypes_e.INPUT_DISTRIBLOAD_UNIT
The input distributed load unit.

Tekla.Structures.Dialog.dotdiaUnitTypes_e.OUTPUT_DISTRIBLOAD_UNIT
The output distributed load unit.

Tekla.Structures.Dialog.dotdiaUnitTypes_e.INPUT_SPRINGCONSTANT_UNIT
The input spring constant unit.

Tekla.Structures.Dialog.dotdiaUnitTypes_e.OUTPUT_MASSPERLENGTH_UNIT
The output mass per length unit.

Tekla.Structures.Dialog.dotdiaUnitTypes_e.INPUT_SURFACELOAD_UNIT
The input surface load unit.

Tekla.Structures.Dialog.dotdiaUnitTypes_e.OUTPUT_SURFACELOAD_UNIT
The output surface load unit.

Tekla.Structures.Dialog.dotdiaUnitTypes_e.INPUT_STRENGTH_UNIT
The input strength unit.

Tekla.Structures.Dialog.dotdiaUnitTypes_e.OUTPUT_STRESS_UNIT
The output stress unit.

Tekla.Structures.Dialog.dotdiaUnitTypes_e.INPUT_MODULUS_UNIT
The input modulus unit.

Tekla.Structures.Dialog.dotdiaUnitTypes_e.INPUT_DENSITY_UNIT
The input density unit.

Tekla.Structures.Dialog.dotdiaUnitTypes_e.INPUT_MOMENT_UNIT
The input moment unit.

Tekla.Structures.Dialog.dotdiaUnitTypes_e.OUTPUT_MOMENT_UNIT
The output moment unit.

Tekla.Structures.Dialog.dotdiaUnitTypes_e.INPUT_DISTRIBMOMENT_UNIT
The input distributed moment unit.

Tekla.Structures.Dialog.dotdiaUnitTypes_e.INPUT_ROTSPRINGCONST_UNIT
The input rotation spring constant unit.

Tekla.Structures.Dialog.dotdiaUnitTypes_e.INPUT_TEMPERATURE_UNIT
The input temperature unit.

Tekla.Structures.Dialog.dotdiaUnitTypes_e.OUTPUT_TEMPERATURE_UNIT
The output temperature unit.

Tekla.Structures.Dialog.dotdiaUnitTypes_e.INPUT_THERMDILATCOEFF_UNIT
The input thermal dilatation coefficient unit.

Tekla.Structures.Dialog.dotdiaUnitTypes_e.INPUT_FACTOR_UNIT
The input factor unit.

Tekla.Structures.Dialog.dotdiaUnitTypes_e.INPUT_DATE_UNIT
The input date unit.

Tekla.Structures.Dialog.dotdiaUnitTypes_e.INPUT_DATE_TIME_MIN_UNIT
The input date time minutes unit.

Tekla.Structures.Dialog.dotdiaUnitTypes_e.INPUT_DATE_TIME_SEC_UNIT
The input date time seconds unit.

Tekla.Structures.Dialog.dotdiaUnitTypes_e.INPUT_LENGTH_FRACTIONAL_IMPERIAL
The input length, fractional imperial.

Tekla.Structures.Dialog.dotdiaUnitTypes_e.INPUT_DEFORMATION_FRACTIONAL_IMPERIAL
The input deformation, fractional imperial.

Tekla.Structures.Dialog.dotdiaUnitTypes_e.INPUT_DIMENSION_FRACTIONAL_IMPERIAL
The input dimension, fractional imperial.

Tekla.Structures.Dialog.dotdiaUnitTypes_e.INPUT_RADIUSOFINERTIA_FRACTIONAL_IMPERIAL
The input radius of inertia, fractional imperial.

Tekla.Structures.Dialog.dotdiaUnitTypes_e.OUTPUT_LENGTH_FRACTIONAL_IMPERIAL
The output length, fractional imperial.

Tekla.Structures.Dialog.dotdiaUnitTypes_e.OUTPUT_DEFORMATION_FRACTIONAL_IMPERIAL
The output deformation, fractional imperial.